class TextMessage:
    START_MESSAGE = """
    Я — Умная Карточка и помогу сделать дизайн для маркетплейсов:
🎯 красиво, ✅ чётко и ⏰ вовремя!"""

    HELP_MESSAGE = """<b>💬 При возникновении вопросов пишите в Telegram</b>: @Taisiya_li"""
    TARIF_MESSAGE_ONE = """<b>Тарифы в боте</b>:

🔹 <b>1 карточка</b> — 8000₸ / 16$

🔹 <b>3 карточки</b> — 24000₸ / 47$

🔹 <b>5 карточек</b> — 35000₸ / 68$

🔹 <b>10 карточек</b> — 45000₸ / 87$

"""
    
    
    NAME_TEXT =''' 🛍 Название товара
✏️ Напиши, как ты хочешь, чтобы мы назвали его на карточке.

📌 Например:
— «Женская блузка с пуговицами»
— «Сыворотка для лица с гиалуронкой»''' 


    
    
    DISCRIPTION_TEXT = """📝 Описание товара

Опиши свой товар, чтобы мы сделали классный текст для карточки:

👤 Для кого он?
🌿 Какие материалы?
💎 В чём польза или особенность?

✍️ Пример:
Эко-сумка из хлопка, с принтом. Лёгкая, вместительная. Подходит для прогулок и покупок.»"""
    

    
    PHOTO_TEXT = '''
📸 Загрузи 2–5 фото товара
Мы подберём лучшие ракурсы для дизайна и сделаем карточки 🔥

💡 Чем качественнее фото — тем круче результат!'''
    
    
    CONTACT_TEXT = '''
📬 Как с тобой связаться, чтобы прислать готовую карточку?

📱 Оставь свой Telegram, WhatsApp или просто имя — куда отправить готовый дизайн?

✍️ Например:
@username
+7 900 000 00 00 (WhatsApp)
Катя, Telegram'''


    INVOICE_TEXT ="""
Переводите {price} на  карту:

🌸<code>5599002114752977</code>
<code>Тимофей П</code>

После перевода, пожалуйста:
1️⃣ Сделайте скриншот чека/перевода.
2️⃣ Отправьте скриншот сюда в бот.
3️⃣ После подтверждения мы начнём работу над вашей карточкой!

Спасибо за доверие!
Работаем быстро и с любовью!"""

    WISHES_KEYBOARD = [
        "🪞 Стоит на зеркале",
        "🏖️ Лежит на дороге летом",
        "☕ На фоне заката",
        "➕ Свой вариант (напишу)"
    ]
    

    DETAILS_KEYBOARD = [
        "🌸 Цветы",
        "🪨 Камни",
        "🌱 Трава",
        "📚 Книги",
        "🕯️ Свечи",
        "➕ Другое (напишу)"
    ]


    CARD_KEYBOARD = [
        "💳 1 карточка — 8 000₸",
        "💳 3 карточки — 24 000₸",
        "💳 5 карточек — 35 000₸",
        "💳 10 карточек — 45 000₸",
        
    ]

    TERM_KEYBOARD = [
        "⚡️ Да, срочно (+10 000₸)",
        "⏳ Нет, можно в обычном режиме"
    ]

    SLAID_KEYBOARD = [
        '➖ 3️⃣',
        "➖ 4️⃣",
        "➖ 5️⃣"
    ]
    
    STYLE_KEYBOARD = [
        "1️⃣ Яркий и цепляющий",
        "2️⃣ Строгий и стильный",
        "3️⃣ Мягкий и нежный"
        
    ]